<!-- За основу всегда берем template -->
<template>
    <!-- должен быть корень -->
    <div class="s-warrper">

        <!-- выводим так title и data -->
        <!-- <p>{{ title }}</p> -->

        <!-- для сохранения состояния компонентов особенно если они не из хранилища -->
        <!-- <keep-alive>             -->
            <!-- выводим роутер -->
            <router-view/>
        <!-- </keep-alive> -->

        <!-- <sCatalog></sCatalog> -->

        <!-- v-if как if в js показываем если есть длинна(то есть что-то) -->
        <!-- связываем для возврата массива -->
        <!-- <sCard
        v-if="CARD.length"
        :card_data="CARD"
        >
        </sCard> -->
    </div>
</template>

<!-- всегд скрипт -->
<script>

// вызываем компоненты
// import sCatalog from './s-catalog.vue';
// import sCard from './s-card.vue';

// import { mapGetters } from 'vuex';

// нужно экспортировать дэфолт состояние 
    export default{
        // так называем имя компонента и это обязательно
        name: 's-warrper',
        // так мы создаем родителя и говорим какие компоненты ему дети
        components:{
            // sCard,
            // sCatalog,
        },
        // то что прилетает из родителя
        props:{},
        // то что возврщает на страницу чтобы не писать кучу раз одно и тоже
        data(){
            return{
                title: "Main warrper"
            }
        },
        // способности вычеслителного характера если из одного компон прилетает A и из друг B то их можно сложить итд
        computed:{
            // ...mapGetters([
            //     'CARD'
            // ])
        },
        // все модальные окна анимации итд то есть отлавливает клики пользователя
        methods:{},
        // отлавливает любые изминения в компаненте и можно что-то делать с ними
        watch:{},
        // хуки один из них один из основных 
        mounted(){
            // можем вывести что-то
            console.log("HeellOO fsociety")
        }

    }
</script>

<!-- прописываем стили метод scoped позваляет присвоеть классу стиль на этой странице если они одинаков-->
<style scoped>
    .s-warrper{
        max-width: 900px;
        margin: 0 auto;
    }
</style>
